### Pandas Data Structure

In [1]:
import pandas as pd

#### Data Structure
- Series    - 1 Dimensional
- DataFrame - 2 Dimensional

In [2]:
pd.Series(data=[1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.DataFrame(data=[1,2,3,4])

   0
0  1
1  2
2  3
3  4

In [4]:
marks = pd.DataFrame({"Name":["Hendry","Mathew"],"Maths":[79,80],"science":[80,81]})

In [5]:
marks

     Name  Maths  science
0  Hendry     79       80
1  Mathew     80       81